{
  "backend/main.mo": "Motoko canister implementing user profiles, room creation, and basic chat storage with access control checks for user and admin permissions.",
  "feature_evidence.json": "Feature evidence report listing implemented group chat UI pages and React Query hooks with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of various frontend components, hooks, and pages in the app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the Zego WebRTC SDK and mounting the React app.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for rooms, profiles, and group-related pages and wraps the app in theme and toast providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time profile creation collecting display name and optional avatar URL.",
  "frontend/src/components/auth/RequireAuth.tsx": "Component that restricts access to authenticated users and shows a login prompt fallback when unauthenticated.",
  "frontend/src/components/common/QueryStates.tsx": "Reusable UI components for loading, error, and empty states.",
  "frontend/src/components/follow/FollowButton.tsx": "Follow/unfollow button using React Query hooks to update follow status with feedback via toasts.",
  "frontend/src/components/group/GroupChatPanel.tsx": "Displays group chat messages and a form to send new messages with validation and auth gating.",
  "frontend/src/components/group/GroupMembershipControls.tsx": "Shows join/leave group buttons based on membership status and handles membership mutations with error toasts.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with navigation, user profile handling, and an outlet for routed pages.",
  "frontend/src/components/room/AudioClipsPanel.tsx": "Allows mic holders to record and upload audio clips and lists existing clips with playback controls.",
  "frontend/src/components/room/ChatPanel.tsx": "Renders room chat messages and an authenticated input form for sending new chat messages.",
  "frontend/src/components/room/GiftsPanel.tsx": "Displays gift catalog, user balance, and lets authenticated users purchase and send gifts to the room owner.",
  "frontend/src/components/room/MicQueuePanel.tsx": "UI panel to view current mic holder, manage mic request queue, and allow users or room owners to request or accept mic access.",
  "frontend/src/components/room/RecentGiftsFeed.tsx": "Displays recent gift transactions for a room owner, showing sender, recipient, gift name, and timestamp.",
  "frontend/src/components/room/ZegoGroupCall.tsx": "Empty placeholder file for a future Zego group call component.",
  "frontend/src/components/room/ZegoLiveStream.tsx": "Initializes and manages a Zego live streaming session, handling SDK setup, token fetching, stream playback, and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useChat.ts": "Hooks for fetching room chat messages and sending new messages using the backend actor.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch and update the current user's profile via the backend actor.",
  "frontend/src/hooks/useFollow.ts": "Hooks for follower data, checking follow status, and performing follow/unfollow actions.",
  "frontend/src/hooks/useGifts.ts": "Hooks for gift catalog, balance, sending gifts, and retrieving gift history.",
  "frontend/src/hooks/useGroupChat.ts": "Hooks for fetching and sending group chat messages for a given group ID.",
  "frontend/src/hooks/useGroupMembership.ts": "Hooks to check group membership, list members, and join or leave groups.",
  "frontend/src/hooks/useGroups.ts": "Hooks to list groups, fetch a single group, and create new groups via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login state, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useMic.ts": "React Query hooks for mic-related canister calls, including requesting, accepting, and querying mic holders, queues, and audio clips.",
  "frontend/src/hooks/useRooms.ts": "React Query hooks for fetching rooms, fetching a single room, and creating new rooms via actor methods.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches and caches a user's display name using their principal, falling back to a truncated principal string.",
  "frontend/src/hooks/useZegoExpressEngineSdk.ts": "Loads and monitors the ZegoExpressEngine SDK from CDN with retry logic and readiness state.",
  "frontend/src/hooks/useZegoKitToken.ts": "Generates and caches ZegoKit tokens for hosts or audience, choosing user identity based on authentication state.",
  "frontend/src/index.css": "Tailwind CSS base definitions and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateGroupPage.tsx": "Page for creating a new group with a form, validation, and auth requirement, using the createGroup mutation.",
  "frontend/src/pages/CreateRoomPage.tsx": "Form page that creates a live room after checking camera and microphone permissions and then navigates to the new room.",
  "frontend/src/pages/ExploreGroupsPage.tsx": "Lists all chat groups with loading and error states and provides navigation to individual groups or group creation.",
  "frontend/src/pages/ExploreRoomsPage.tsx": "Displays all live rooms with loading and empty states and links users to room pages or room creation.",
  "frontend/src/pages/GroupPage.tsx": "Shows a specific group’s details, members, and chat panel with membership controls.",
  "frontend/src/pages/RoomPage.tsx": "Displays a live room with streaming, chat, mic queue, gifts, and owner info, handling loading and error states.",
  "frontend/src/pages/UserProfilePage.tsx": "Fetches and displays a user’s profile, avatar, and follower stats with follow button and loading states.",
  "frontend/src/types/zego-express-engine-webrtc.d.ts": "Type definitions for the ZEGOCLOUD Express Engine WebRTC SDK, including user, stream, room, and permission interfaces plus the global Window extension.",
  "frontend/src/types/zego-uikit-prebuilt.d.ts": "Empty placeholder type declaration file for the Zego UI Kit prebuilt package.",
  "frontend/src/utils/guestUserId.ts": "Generates, stores, retrieves, and clears a persistent guest user ID using sessionStorage.",
  "frontend/src/utils/loadExternalScript.ts": "Empty utility file reserved for loading external scripts.",
  "frontend/src/utils/mediaPermissions.ts": "Provides functions to request and check camera/microphone permissions, including detailed error handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/src/utils/zegoConfig.ts": "Defines static ZEGOCLOUD app configuration and validates required fields.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, animations, plugins, and typography/container settings.",
  "project_state.json": "Describes project state, including features, architecture notes, and pending requests for ZEGOCLOUD live rooms, chat, and dating modules."
}