{
  "backend/main.mo": "Main canister logic handling user profiles, rooms, chat, and authorization with access control and room/message storage.",
  "backend/migration.mo": "Migration module converting old room data by removing the streamUrl field and producing a new rooms map.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the project.",
  "frontend/index.css": "Tailwind base styles defining light/dark design tokens and global layout variables.",
  "frontend/index.html": "HTML entry file loading the app root and ZEGO UIKit Prebuilt script.",
  "frontend/src/App.tsx": "Top-level React app configuring TanStack Router routes and theme provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and session clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile with display name and optional avatar.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard component showing a login prompt if the user is not authenticated.",
  "frontend/src/components/common/QueryStates.tsx": "Reusable UI components for loading, error, and empty data states.",
  "frontend/src/components/follow/FollowButton.tsx": "Renders a follow/unfollow button, calling follow/unfollow hooks and showing toast notifications. Hides itself when not authenticated or when targeting self.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with header, navigation, footer, and conditional profile setup dialog. Shows login state and routes content via Outlet.",
  "frontend/src/components/room/AudioClipsPanel.tsx": "Displays audio clips for a room and allows the mic holder to record and upload new clips. Handles audio recording via MediaRecorder and playback via ClipItem.",
  "frontend/src/components/room/ChatPanel.tsx": "Shows chat messages for a room and lets authenticated users send new messages. Includes basic validation and a scrollable message list.",
  "frontend/src/components/room/GiftsPanel.tsx": "Displays gift catalog, user balance, and allows sending gifts to the room owner. Supports balance top‑ups and gift selection with toast feedback.",
  "frontend/src/components/room/MicQueuePanel.tsx": "Shows current mic holder and request queue, allowing users to request the mic and room owners to approve requests. Renders queue items with accept controls for owners.",
  "frontend/src/components/room/RecentGiftsFeed.tsx": "Lists recent gift transactions sent to the room owner, showing sender, recipient, and gift name. Pulls catalog data to resolve gift names.",
  "frontend/src/components/room/ZegoGroupCall.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/room/ZegoLiveStream.tsx": "Initializes and manages a Zego live stream instance, handling token loading, SDK availability, role setup, room join, and cleanup with error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useChat.ts": "Provides hooks to fetch chat messages with polling and send messages, invalidating message queries on send.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and caches the caller’s user profile and provides a mutation to save updates, refreshing profile queries on success.",
  "frontend/src/hooks/useFollow.ts": "Handles follower counts, follow state, and follow/unfollow mutations with query invalidation for related data.",
  "frontend/src/hooks/useGifts.ts": "Supplies gift catalog, balance, gift history, and gift‑related mutations, refreshing affected queries after updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity persistence through a React context.",
  "frontend/src/hooks/useMic.ts": "Implements mic‑related queries and mutations, including mic holder, queue, audio clips, and request/accept/record actions.",
  "frontend/src/hooks/useRooms.ts": "Provides hooks to list rooms, fetch a room, and create new rooms, invalidating room lists on creation.",
  "frontend/src/hooks/useUserDisplayName.ts": "Fetches a user’s display name or fallback, caching results briefly for efficiency.",
  "frontend/src/hooks/useZegoKitToken.ts": "Generates and caches Zego live‑stream tokens for authenticated users, with backend feature checks and detailed error handling.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global base styles and defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/CreateRoomPage.tsx": "Provides a form for authenticated users to create a new live room with title and description.",
  "frontend/src/pages/ExploreRoomsPage.tsx": "Fetches and displays a list of live rooms with loading states, errors, and navigation to room details.",
  "frontend/src/pages/RoomPage.tsx": "Loads a specific room, shows stream, owner info, and related panels, handling loading and error states.",
  "frontend/src/pages/UserProfilePage.tsx": "Displays a user profile with avatar, follower counts, and follow button, handling loading and not-found cases.",
  "frontend/src/types/zego-uikit-prebuilt.d.ts": "Declares TypeScript types for Zego UIKit global APIs and room join configuration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for styling the frontend.",
  "project_state.json": "Defines the project's current state, goals, architecture rules, and feature requirements for building a mobile live streaming app using ZEGOCLOUD and Firebase."
}