{
  "kind": "build_request",
  "title": "Add Helo/Yo-style Group Chat (groups, membership, messaging)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a persistent Group Chat domain in the Motoko backend that supports creating groups, listing groups, viewing a group, joining/leaving a group, and posting/reading group messages (separate from the existing per-room chat).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Group chat app bana do hello yo jesa"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes stable canister methods for: createGroup, listGroups, getGroup, joinGroup, leaveGroup, sendGroupMessage, getGroupMessages.",
        "Group messages include sender Principal, content, and timestamp (consistent with existing ChatMessage shape where possible).",
        "Only authenticated users can create groups and send messages; unauthenticated users can browse group list and read public group info/messages if allowed by the backend rules defined in this requirement.",
        "Joining/leaving updates membership state; sending a message to a members-only group fails with a clear error if caller is not a member.",
        "Data is stored in canister state (in-memory stable state as per current project patterns)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add frontend pages and routing for Group Chat: a group discovery/list page, a group creation flow, and a group chat room page with message timeline and composer (Helo/Yo-like group feed experience).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Group chat app bana do hello yo jesa"
        ]
      },
      "acceptanceCriteria": [
        "App has a Group Chat entry point reachable from the main navigation (AppShell) and/or the home page.",
        "Group list page shows existing groups with basic metadata and a clear action to open/join a group.",
        "Authenticated users can create a group from the UI (with at least a name and optional description).",
        "Group chat page shows messages, sender display names (reuse existing display-name utilities), and supports sending messages with validation (non-empty, reasonable max length).",
        "UI uses polling via React Query (similar to existing room chat) to refresh group messages without requiring WebSockets.",
        "All user-facing text added for the new feature is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create React Query hooks for Group Chat operations (list groups, get group, membership actions, send/fetch messages) and integrate them with the existing authenticated actor pattern.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Group chat app bana do hello yo jesa"
        ]
      },
      "acceptanceCriteria": [
        "New hooks follow the same conventions as existing hooks (React Query query keys, invalidation on mutations).",
        "When a user sends a group message, the message list updates via query invalidation/refetch.",
        "Hooks gracefully handle the actor not being ready (return empty lists / disabled queries) consistent with current patterns."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is required.",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement 1:1 direct messaging in this change.",
    "Do not implement dating/matching features in this change.",
    "Do not implement real-time transport (WebSockets/push notifications); use React Query polling like the existing room chat.",
    "Do not implement ZEGOCLOUD token generation changes as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User-facing text should be English"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}