{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend Group Chat UI + React Query hooks",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add Group Chat pages, routing, and navigation for group discovery, group creation, and group message feed with composer.",
      "acceptanceCriteria": [
        "App has a Group Chat entry point reachable from the main navigation (AppShell) and/or the home page.",
        "Group list page shows existing groups with basic metadata and a clear action to open/join a group.",
        "Authenticated users can create a group from the UI (with at least a name and optional description).",
        "Group chat page shows messages, sender display names (reuse existing display-name utilities), and supports sending messages with validation (non-empty, reasonable max length).",
        "UI uses polling via React Query (similar to existing room chat) to refresh group messages without requiring WebSockets.",
        "All user-facing text added for the new feature is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register new Group Chat routes (group list/discovery page, create group page, and group room page) in the TanStack Router route tree, keeping existing routes intact."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Add a main navigation entry point for Group Chat (e.g., “Groups”), and an authenticated-only entry for “Create Group”, consistent with existing auth-aware nav patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ExploreGroupsPage.tsx",
          "operation": "create",
          "description": "Create a group discovery/list page that loads groups, shows basic metadata (name, optional description, owner display name, created date), and provides clear actions to open a group and (when authenticated) join/leave via membership controls. Use existing UI primitives and existing query state helpers. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CreateGroupPage.tsx",
          "operation": "create",
          "description": "Create an authenticated group creation flow (name required, description optional) using RequireAuth, form validation, and toast feedback; navigate to the new group page after successful creation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GroupPage.tsx",
          "operation": "create",
          "description": "Create a group chat room page that displays group info, membership state (join/leave), and a message timeline with a composer. Show sender display names using the existing display-name hook and render timestamps consistently with the room chat. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/group/GroupChatPanel.tsx",
          "operation": "create",
          "description": "Create a reusable GroupChatPanel (Helo/Yo-like group feed experience) that shows messages in a scroll area and an authenticated composer. Validate message content (non-empty, max length aligned with room chat) and surface backend errors with user-friendly English messages. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/group/GroupMembershipControls.tsx",
          "operation": "create",
          "description": "Create a small component to display and toggle membership (join/leave) for authenticated users, showing appropriate disabled/loading states and error toasts. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add React Query hooks for Group Chat operations and integrate with the existing authenticated actor pattern and cache invalidation conventions.",
      "acceptanceCriteria": [
        "New hooks follow the same conventions as existing hooks (React Query query keys, invalidation on mutations).",
        "When a user sends a group message, the message list updates via query invalidation/refetch.",
        "Hooks gracefully handle the actor not being ready (return empty lists / disabled queries) consistent with current patterns."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useGroups.ts",
          "operation": "create",
          "description": "Add React Query hooks for group domain operations: listGroups, getGroup, createGroup, and query invalidation to keep the group list and group details up to date. Follow existing conventions from useRooms (query keys, enabled guards when actor is not ready)."
        },
        {
          "path": "frontend/src/hooks/useGroupMembership.ts",
          "operation": "create",
          "description": "Add React Query hooks for membership operations: isGroupMember, getGroupMembers (if needed by UI), joinGroup, leaveGroup, with proper query keys and invalidation so membership state and member lists refresh after mutations."
        },
        {
          "path": "frontend/src/hooks/useGroupChat.ts",
          "operation": "create",
          "description": "Add React Query hooks for group messaging: getGroupMessages with polling (similar to useChat), and sendGroupMessage mutation that invalidates/refetches the group messages query on success. Ensure hooks are disabled when actor is not ready and return safe empty defaults where appropriate."
        },
        {
          "path": "frontend/src/components/group/GroupChatPanel.tsx",
          "operation": "modify",
          "description": "Wire GroupChatPanel to the new hooks (message polling + send mutation), and ensure on send success the list refreshes via invalidation/refetch consistent with existing room chat behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ExploreGroupsPage.tsx",
          "operation": "modify",
          "description": "Connect the group list page to the new listGroups hook, handle loading/error/empty states consistently with existing pages, and ensure navigation into GroupPage is wired. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CreateGroupPage.tsx",
          "operation": "modify",
          "description": "Connect the create group form to the new createGroup hook and invalidate the group list on success, matching existing mutation patterns (e.g., CreateRoomPage + useRooms). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GroupPage.tsx",
          "operation": "modify",
          "description": "Connect GroupPage to getGroup, membership hooks, and group message hooks; ensure membership actions invalidate membership and message queries as needed and that unauthenticated users can still browse group info/messages (UI gating only for create/join/send). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}